C:\demo\aaa\terraform>terraform.exe apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # esxi_guest.vm will be created
  + resource "esxi_guest" "vm" {
      + boot_disk_size         = (known after apply)
      + clone_from_vm          = "iis_template"
      + disk_store             = "datastore1"
      + guest_name             = "DISIISC55x"
      + guest_shutdown_timeout = (known after apply)
      + guest_startup_timeout  = (known after apply)
      + guestos                = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + memsize                = "2049"
      + notes                  = (known after apply)
      + numvcpus               = "2"
      + ovf_properties_timer   = (known after apply)
      + power                  = "on"
      + resource_pool_name     = (known after apply)
      + virthwver              = (known after apply)

      + network_interfaces {
          + mac_address     = (known after apply)
          + nic_type        = (known after apply)
          + virtual_network = "servers"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

esxi_guest.vm: Creating...

Error: There was an ovftool Error:
C:\demo\aaa\terraform>ovftool --acceptAllEulas --noSSLVerify --X:useMacNaming=false  -dm=thin --name="DISIISC55x" --overwrite -ds="datastore1"  "vi://root:1234%21@192.168.0.200/iis_template" "vi://root:1234%21@192.168.0.200/"
Opening VI source: vi://root@192.168.0.200:443/iis_template
Error: ExtraConfig options exists in source (use --allowExtraConfig option to allow this).
Completed with errors

exit status 1


  on main.tf line 16, in resource "esxi_guest" "vm":
  16: resource "esxi_guest" "vm" {


File called : ovf_cmd.bat is created. Files mail. and variables are above. terraform and plugins are located in same folder, ovftool have path defined (it's called without issue) ony thing that seems to be missing is this setting for ovftool.

So my question is, can I add this ( --allowExtraConfig) somewhere to my terrraforms variables so ovf_cmd.bat would include it while beeing created ?


